#include <iostream>
#include <cmath>

int main() {
    double a, b, c, d = 0, x1, x2;
    std::cin >> a >> b >> c;
    if (a == 0) {//линейное уравнение вида bx+c=0
        if (b != 0) {
            std::cout << -c / b;
        }
        else {
            //не имеет решений, т.к. по условию получиться что С !=0
        }
    }
    else {//a!=0 квадратное уравнение
        if (b != 0 && c != 0) {//полное квадратное
            d = (b*b - 4 * a*c);//вычисляем дискриминант
            if (d < 0) {
                //нет действительных корней
            }
            else {
                if (d == 0) {//одинаковые корни
                    x1 = x2 = -b / (2 * a);
                    std::cout << x1;
                }
                else {//d>0  два корня
                    x1 = (-b + sqrt(d)) / (2 * a);
                    x2 = (-b - sqrt(d)) / (2 * a);
                    std::cout << x1 << " " << x2;
                }
            }
        }
        else {
            if (b == 0 && c == 0) {//неполное квадратное 1 вариант
                std::cout << 0;//x==0
            }
            else {
                if (b != 0) {//c==0 2й вариант
                    //имеет два корня
                    x1 = 0;
                    x2 = -b / a;
                    std::cout << x1 << " " << x2;
                }
                else {//c!=0 && b==0 3й вариант
                    if (-c / a > 0) {
                        x1 = sqrt(-c / a);
                        x2 = -sqrt(-c / a);
                        std::cout << x1 << " " << x2;
                    }
                    else {
                        //не имеет действительных корней
                    }
                }
            }
        }
    }
}
